YodaCh96/AVR_ATmega/elob_os/BS_Ser.c
/*
 *  module global variables
 */
static volatile unsigned char UART_TxBuf[UART_TX_BUFFER_SIZE];
static volatile unsigned char UART_RxBuf[UART_RX_BUFFER_SIZE];
static volatile unsigned char UART_TxHead;
static volatile unsigned char UART_TxTail;
static volatile unsigned char UART_RxHead;
static volatile unsigned char UART_RxTail;
static volatile unsigned char UART_LastRxError;
//static volatile unsigned char UART_LastRxError;


// PIUS
static volatile unsigned char uart0_EventChar;
static volatile unsigned char uart1_EventChar;

volatile uint8_t uart_Flags;
#define UART_FLAG_1ECHOON 1


void uart_setEcho1(const uint8_t Flag)
{
   if(Flag)
      uart_Flags |= UART_FLAG_1ECHOON;
   else 
      uart_Flags &= ~UART_FLAG_1ECHOON;
}

static volatile unsigned char UART1_TxBuf[UART1_TX_BUFFER_SIZE];
static volatile unsigned char UART1_RxBuf[UART1_RX_BUFFER_SIZE];
static volatile unsigned char UART1_TxHead;
static volatile unsigned char UART1_TxTail;
static volatile unsigned char UART1_RxHead;
static volatile unsigned char UART1_RxTail;
static volatile unsigned char UART1_LastRxError;






static void PushError(const uint8_t UartErr, const uint8_t UartNo)
{
   // check for Frame or Overrun error
   if ( UartErr & (UART_FRAME_ERROR>>8) )
      error_put(FERR_UART0_FRAME+UartNo ); // Framing Error detected, i.e no stop bit detected 

   // Overrun, a character already present in the UART UDR register was 
   // not read by the interrupt handler before the next character arrived,
   // one or more received characters have been dropped
   if ( UartErr & (UART_OVERRUN_ERROR>>8)) 
      error_put(FERR_UART0_OVER+UartNo ); 

   // We are not reading the receive buffer fast enough,
   // one or more received character have been dropped 
   if ( UartErr & (UART_BUFFER_OVERFLOW>>8)) 
      error_put(FERR_UART0_BUFF+UartNo); 
}



/*************************************************************************
Function: UART Receive Complete interrupt
Purpose:  called when the UART has received a character
**************************************************************************/




ISR (USART0_RX_vect) // UART0_RECEIVE_INTERRUPT)	
{
    unsigned char tmphead;
    unsigned char data;
    unsigned char usr;
    unsigned char lastRxError;

    // read UART status register and UART data register
    data = UART0_DATA;
    usr  = UART0_STATUS;

    // get FEn (Frame Error) DORn (Data OverRun) UPEn (USART Parity Error) bits 
    #if defined(FE) && defined(DOR) && defined(UPE)
      lastRxError = usr & (_BV(FE)|_BV(DOR)|_BV(UPE) );
    #elif defined(FE0) && defined(DOR0) && defined(UPE0)
      lastRxError = usr & (_BV(FE0)|_BV(DOR0)|_BV(UPE0) );
    #elif defined(FE1) && defined(DOR1) && defined(UPE1)
      lastRxError = usr & (_BV(FE1)|_BV(DOR1)|_BV(UPE1) );
    #elif defined(FE) && defined(DOR)
      lastRxError = usr & (_BV(FE)|_BV(DOR) );
    #endif


    // calculate buffer index
    tmphead = ( UART_RxHead + 1) & UART_RX_BUFFER_MASK;
    
    if ( tmphead == UART_RxTail ) 
       lastRxError = UART_BUFFER_OVERFLOW >> 8; // error: receive buffer overflow
    else {
       UART_RxHead = tmphead;       // store new index
       UART_RxBuf[tmphead] = data;  //  store received data in buffer
    }


    if(data == uart0_EventChar) {  // is it the char to release a event ?
       putQueue(EVENT_RXUART0);
    }


    if(lastRxError) {
	   PushError(lastRxError, 0);
    }

    UART_LastRxError |= lastRxError;   
}



/*************************************************************************
Function: UART Data Register Empty interrupt
Purpose:  called when the UART is ready to transmit the next byte
**************************************************************************/

ISR (UART0_TRANSMIT_INTERRUPT)
{
   unsigned char tmptail;
   if ( UART_TxHead != UART_TxTail) {
      // calculate and store new buffer index 
      tmptail = (UART_TxTail + 1) & UART_TX_BUFFER_MASK;
      UART_TxTail = tmptail;
      // get one byte from buffer and write it to UART 
      UART0_DATA = UART_TxBuf[tmptail];  // start transmission
   }
   else {
      // tx buffer empty, disable UDRE interrupt
      UART0_CONTROL &= ~_BV(UART0_UDRIE);
   }
}




/*************************************************************************
Function: uart_init()
Purpose:  initialize UART and set baudrate
Input:    baudrate using macro UART_BAUD_SELECT()
Returns:  none
**************************************************************************/
void uart_init(unsigned int baudrate)
{
   cli();
   UART_TxHead = 0;
   UART_TxTail = 0;
   UART_RxHead = 0;
   UART_RxTail = 0;


   #ifdef UART_TEST
   #ifndef UART0_BIT_U2X
      #warning "UART0_BIT_U2X not defined"
   #endif
   #ifndef UART0_UBRRH
      #warning "UART0_UBRRH not defined"
   #endif
   #ifndef UART0_CONTROLC
      #warning "UART0_CONTROLC not defined"
   #endif
   #if defined(URSEL) || defined(URSEL0)
   #ifndef UART0_BIT_URSEL
      #warning "UART0_BIT_URSEL not defined"
   #endif
   #endif
   #endif

    if ( baudrate & 0x8000 ) {
        #if UART0_BIT_U2X
           UART0_STATUS = (1<<UART0_BIT_U2X);  //Enable 2x speed 
        #endif
    } 
 
    #if defined(UART0_UBRRH)
       UART0_UBRRH = (unsigned char)((baudrate>>8)&0x80) ;  // <-
    #endif    
       UART0_UBRRL = (unsigned char) (baudrate&0x00FF);      // <- 0009 fuer 115k


    UCSR0B = (1<<RXCIE0) | (1<<TXCIE0) | (1<<UDRIE0)  | (1<<RXEN0)  | (1<<TXEN0);

    // Enable USART receiver and transmitter and receive complete interrupt 
    UART0_CONTROL = _BV(UART0_BIT_RXCIE)| (1<<UART0_BIT_RXEN)| (1<<UART0_BIT_TXEN);

    sei();



    // Set frame format: asynchronous, 8data, no parity, 1stop bit 
    #ifdef UART0_CONTROLC
    #ifdef UART0_BIT_URSEL
    UART0_CONTROLC = (1<<UART0_BIT_URSEL)|(1<<UART0_BIT_UCSZ1)|(1<<UART0_BIT_UCSZ0);
    #else
    UART0_CONTROLC = (1<<UART0_BIT_UCSZ1)|(1<<UART0_BIT_UCSZ0); // <-
    #endif 
    #endif

    // PIUS
    uart0_EventChar = 0x0D; // CR
} // uart_init


/*************************************************************************
Function: uart_getc()
Purpose:  return byte from ringbuffer  
Returns:  lower byte:  received byte from ringbuffer
          higher byte: last receive error
**************************************************************************/




unsigned int uart_getc(void)
{    
    unsigned char tmptail;
    unsigned char data;
    unsigned char lastRxError;

    lastRxError = 0;
	data = 0;

    if ( UART_RxHead == UART_RxTail ) {
        return UART_NO_DATA;   /* no data available */
    }
    
    // calculate buffer index
    tmptail = (UART_RxTail + 1) & UART_RX_BUFFER_MASK;
    
    // get data from receive buffer
    data        = UART_RxBuf[tmptail];
    lastRxError = UART_LastRxError;
    
