YodaCh96/AVR_ATmega/elob_os/BS_Ser.c
    // store buffer index 
    UART_RxTail = tmptail; 
    UART_LastRxError = 0;
    return (lastRxError << 8) + data;
} // uart_getc





uint8_t uart0_getToBuff(char* pBuff)
{
   uint16_t Val;
   uint8_t  Wr  = 0;

   while(!((Val = uart_getc()) & UART_NO_DATA)) { // data
      *(pBuff+Wr++) = (uint8_t)Val;
      *(pBuff+Wr) = 0;
   }
	return Wr;
}


/*************************************************************************
Function: uart_putc()
Purpose:  write byte to ringbuffer for transmitting via UART
Input:    byte to be transmitted
Returns:  none          
**************************************************************************/


void uart_putc( char data)
{
    unsigned char tmphead;
    tmphead  = (UART_TxHead + 1) & UART_TX_BUFFER_MASK;
    
    while ( tmphead == UART_TxTail ) {
       PORTC ^= (1<<PC6);  // PIUS der kommt und dann haengt er
        ;// wait for free space in buffer 
    }
    
    UART_TxBuf[tmphead] = data;
    UART_TxHead         = tmphead;

    // enable UDRE interrupt 
    UART0_CONTROL    |= _BV(UART0_UDRIE);
} // uart_putc





/*************************************************************************
Function: uart_puts()
Purpose:  transmit string to UART
Input:    string to be transmitted
Returns:  none          
**************************************************************************/
void uart_puts(const char *s )
{
    while (*s) 
      uart_putc(*s++);
} // uart_puts 


/*************************************************************************
Function: uart_puts_p()
Purpose:  transmit string from program memory to UART
Input:    program memory string to be transmitted
Returns:  none
**************************************************************************/
void uart_puts_p(const char *progmem_s )
{
    register char c;
    while ( (c = pgm_read_byte(progmem_s++)) ) 
      uart_putc(c);
} // uart_puts_p


/*
 * these functions are only for ATmegas with two USART
 */
#ifdef ATMEGA_USART1


uint8_t uart1_getToBuff(char* pBuff)
{
   uint16_t Val;
   uint8_t  Wr  = 0;

   while(!((Val = uart1_getc()) & UART_NO_DATA)) { // data
      *(pBuff+Wr++) = (uint8_t)Val;
      *(pBuff+Wr) = 0;
   }
   return Wr;
}



/*************************************************************************
Function: UART1 Receive Complete interrupt
Purpose:  called when the UART1 has received a character
**************************************************************************/



ISR(UART1_RECEIVE_INTERRUPT)
{
   unsigned char tmphead;
   unsigned char data;
   unsigned char usr;
   unsigned char lastRxError;

   // read UART status register and UART data register
   usr  = UART1_STATUS;
   data = UART1_DATA;

   // get FEn (Frame Error) DORn (Data OverRun) UPEn (USART Parity Error) bits
   lastRxError = usr & (_BV(FE1)|_BV(DOR1)|_BV(UPE1) );
            
   // calculate buffer index
   tmphead = ( UART1_RxHead + 1) & UART_RX_BUFFER_MASK;
    
   if ( tmphead == UART1_RxTail ) {
      lastRxError = UART_BUFFER_OVERFLOW >> 8; // error: receive buffer overflow
   }
   else {
      UART1_RxHead         = tmphead; // store new index
      UART1_RxBuf[tmphead] = data;    // store received data in buffer 

      //uart_putc(data);  // this is the best place to implement the echo 
        
      if(data == 0x13 || data == 0x11 || data == 0x1A) { // ctrl S oder Q
        // putQueue(EVENT_RXUART1);      // then send the event

      }

      if (data == uart1_EventChar) {    // is it the char to need event ?
         putQueue(EVENT_RXUART1);
      }
      if(lastRxError)
         PushError(lastRxError, 0);
   }
   UART_LastRxError |= lastRxError;   
}

/*************************************************************************
Function: UART1 Data Register Empty interrupt
Purpose:  called when the UART1 is ready to transmit the next byte
**************************************************************************/


ISR(UART1_TRANSMIT_INTERRUPT) 
{
   unsigned char tmptail;
    
   if( UART1_TxHead != UART1_TxTail) {
      // calculate and store new buffer index 
      tmptail = (UART1_TxTail + 1) & UART_TX_BUFFER_MASK;
      UART1_TxTail = tmptail;
      // get one byte from buffer and write it to UART 
      UART1_DATA = UART1_TxBuf[tmptail];  // start transmission 
   }
   else {
      // tx buffer empty, disable UDRE interrupt
      UART1_CONTROL &= ~_BV(UART1_UDRIE);
   }
}



/*************************************************************************
Function: uart1_init()
Purpose:  initialize UART1 and set baudrate
Input:    baudrate using macro UART_BAUD_SELECT()
Returns:  none
**************************************************************************/
void uart1_init(unsigned int baudrate)
{
   UART1_TxHead = 0;
   UART1_TxTail = 0;
   UART1_RxHead = 0;
   UART1_RxTail = 0;


#ifdef UART_TEST
#ifndef UART1_BIT_U2X
#warning "UART1_BIT_U2X not defined"
#endif
#ifndef UART1_UBRRH
#warning "UART1_UBRRH not defined"
#endif
#ifndef UART1_CONTROLC
#warning "UART1_CONTROLC not defined"
#endif
#if defined(URSEL) || defined(URSEL1)
#ifndef UART1_BIT_URSEL
#warning "UART1_BIT_URSEL not defined"
#endif
#endif
#endif

    // Set baud rate 
    if ( baudrate & 0x8000 ) {
       #if UART1_BIT_U2X
    	UART1_STATUS = (1<<UART1_BIT_U2X);  //Enable 2x speed 
       #endif
    }
    UART1_UBRRH = (unsigned char)((baudrate>>8)&0x80) ;  // <-
    UART1_UBRRL = (unsigned char) baudrate;               // <-
        
    // Enable USART receiver and transmitter and receive complete interrupt
    UART1_CONTROL = _BV(UART1_BIT_RXCIE)|(1<<UART1_BIT_RXEN)|(1<<UART1_BIT_TXEN);    
    
    // Set frame format: asynchronous, 8data, no parity, 1stop bit
    #ifdef UART1_BIT_URSEL
      UART1_CONTROLC = (1<<UART1_BIT_URSEL)|(1<<UART1_BIT_UCSZ1)|(1<<UART1_BIT_UCSZ0);
    #else
      UART1_CONTROLC = (1<<UART1_BIT_UCSZ1)|(1<<UART1_BIT_UCSZ0);  // <-
    #endif 


    // PIUS
    uart1_EventChar = 0x0A; // LF
    
} // uart_init


/*************************************************************************
Function: uart1_getc()
Purpose:  return byte from ringbuffer  
Returns:  lower byte:  received byte from ringbuffer
          higher byte: last receive error
**************************************************************************/
unsigned int uart1_getc(void) 
{    
    unsigned char tmptail;
    unsigned int  data;
    unsigned char lastRxError;

    if ( UART1_RxHead == UART1_RxTail ) {
       return UART_NO_DATA;   // no data available 
    }
    
    // calculate buffer index 
    tmptail = (UART1_RxTail + 1) & UART_RX_BUFFER_MASK;
    
    // get data from receive buffer
    data = UART1_RxBuf[tmptail];
    lastRxError = UART1_LastRxError;
    
