YodaCh96/AVR_ATmega/elob_os/BS_Ser.c
    // store buffer index 
    UART1_RxTail = tmptail; 
    
    UART1_LastRxError = 0;
    return (lastRxError << 8) + data;

}// uart1_getc





/*************************************************************************
Function: uart1_putc()
Purpose:  write byte to ringbuffer for transmitting via UART
Input:    byte to be transmitted
Returns:  none          
**************************************************************************/



void uart1_putc(const char data) 
{
     unsigned char tmphead;
       tmphead  = (UART1_TxHead + 1) & UART_TX_BUFFER_MASK;
    
     while ( tmphead == UART1_TxTail ) {
         ;// wait for free space in buffer 
     }
    
     UART1_TxBuf[tmphead] = data;
     UART1_TxHead = tmphead;

     // enable UDRE interrupt
     UART1_CONTROL    |= _BV(UART1_UDRIE);

} // uart1_putc



/*************************************************************************
Function: uart1_puts()
Purpose:  transmit string to UART1
Input:    string to be transmitted
Returns:  none          
**************************************************************************/
void uart1_puts(const char *s )
{
    while (*s) 
       uart1_putc(*s++);

} // uart1_puts


/*************************************************************************
Function: uart1_puts_p()
Purpose:  transmit string from program memory to UART1
Input:    program memory string to be transmitted
Returns:  none
**************************************************************************/
void uart1_puts_p(const char *progmem_s )
{
    register char c;
    while ( (c = pgm_read_byte(progmem_s++)) ) 
       uart1_putc(c);
} // uart1_puts_p 


#endif
